new Vue({
    el: '#app',
    data: {
        name: '',
        phone: '',
        email: '',
        selectedTypeHolidays:0,
        typesHolidays: [
            {
                'id': 1,
                'title': 'Хит',
                'price': '4 900'
            }, {
                'id': 2,
                'title': 'Оптима',
                'price': '6 900'
            }, {
                'id': 3,
                'title': 'Максимум',
                'price': '9 900'
            }, {
                'id': 4,
                'title': 'Всё включено',
                'price': '12 900'
            }
        ],
        quests: [
            {
                'id': 923,
                'title': 'Алькатрас (10+, 14+)',
                'location': 'Стахановцев 21',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 7500,
                        2: 9500,
                        3: 13000,
                        4: 15500
                    },
                    'weekends': {
                        1: 8000,
                        2: 10000,
                        3: 13500,
                        4: 16000
                    }
                },
                countOfPeople: []
            },
            {
                'id': 25,
                'title': 'Мумия (6+,14+)',
                'location': 'Великан парк',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 64,
                'title': 'Мумия (6+,14+)',
                'location': 'Виленский,8',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 453,
                'title': 'Звездные воины (6+, 14+)',
                'location': 'Соляной пер. 8',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 670,
                'title': 'Супергерои: Новое поколение (5+)',
                'location': 'Соляной пер. 8',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 157,
                'title': 'Хоббит: путешествие в средиземье (6+,14+)',
                'location': 'Дмитровский 3-5',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 60,
                'title': 'Чужой (8+, 14+)',
                'location': 'Великан парк',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 451,
                'title': 'Динозавры: Парк юрского периода (12+)',
                'location': 'Соляной переулок',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 443,
                'title': 'Бессознательное (6+, 14+)',
                'location': 'Социалистическая 10',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 71,
                'title': 'Морской бой (6+, 14+)',
                'location': 'Великан парк',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 646,
                'title': 'Алиса в стране чудес (6+, 14+)',
                'location': 'Соляной пер. 8',
                'type': false,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 662,
                'title': 'Как приручить драконов (6+)',
                'location': 'Коломенская 42',
                'type': 2,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 662,
                'title': 'Игры престолов (6+, 14+)',
                'location': 'Коломенская 42',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 1115,
                'title': 'Головоломка (6+, 14+)',
                'location': 'Социалистическая 10',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 1110,
                'title': 'Время приключений (8+)',
                'location': 'Соляной пер. 8',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 680,
                'title': 'Иллюзия обмана (8+, 14+)',
                'location': 'Соляной пер. 8',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 670,
                'title': 'Мстители: темные времена (14+)',
                'location': 'Соляной пер. 8',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
            {
                'id': 17,
                'title': 'Пила (14+) – только в пакете ХИТ',
                'location': 'Коломенская, 42',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: false,
                        3: false,
                        4: false
                    },
                    'weekends': {
                        1: 6900,
                        2: false,
                        3: false,
                        4: false
                    }
                }

            },
            {
                'id': 65,
                'title': 'Цирк дю Сатан (14+) – только в пакете ХИТ',
                'location': 'Коломенская, 42',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: false,
                        3: false,
                        4: false
                    },
                    'weekends': {
                        1: 6900,
                        2: false,
                        3: false,
                        4: false
                    }
                }

            },
            {
                'id': 871,
                'title': 'Последняя тайна да Винчи (8+) – только в пакете ХИТ',
                'location': 'Социалистическая 10',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: false,
                        3: false,
                        4: false
                    },
                    'weekends': {
                        1: 6900,
                        2: false,
                        3: false,
                        4: false
                    }
                }

            },
            {
                'id': 18,
                'title': 'Код да Винчи (8+, 14+)',
                'location': 'Коломенская 42',
                'type': 1,
                'price': {
                    'weekdays': {
                        1: 4900,
                        2: 6900,
                        3: 10500,
                        4: 12900
                    },
                    'weekends': {
                        1: 6900,
                        2: 8900,
                        3: 12500,
                        4: 14900
                    }
                }

            },
        ],

        comments: [
            '*Стоимость пакета зависит от набора услуг и выбранного квеста',
            '*При покупке пакетов другие скидки не действуют',
            '*Стоимость пакета в будни и выходные может отличаться'
        ],

        dates: {},
        times: {}
    },

    props: [],

    created() {

    },

    mounted() {

    },

    beforeUpdate() {

    },
    updated() {

    },
    watch: {

    },

    computed: {},

    methods: {
        selectTypeHolidays:function(id){
                this.selectedTypeHolidays = id;
        },

        changeSelect:function(event){
            this.selectedTypeHolidays = event;
        }
    }
});